Ran Plan for dir: `infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.prod.module.postgresql.aws_rds_cluster.default has changed
~ resource "aws_rds_cluster" "default" {
      ~ engine_version                        = "13.18" -> "13.20"
      ~ engine_version_actual                 = "13.18" -> "13.20"
        id                                    = "jfp-core-prod"
        tags                                  = {}
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.stage.module.postgresql.aws_rds_cluster.default has changed
~ resource "aws_rds_cluster" "default" {
      ~ engine_version                        = "13.18" -> "13.20"
      ~ engine_version_actual                 = "13.18" -> "13.20"
        id                                    = "jfp-core-stage"
        tags                                  = {}
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.prod.module.eks.data.aws_ami.eks-worker will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "eks-worker" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + last_launched_time    = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "602401143452",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + region                = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + "amazon-eks-node-1.32-v*",
            ]
        }
    }

  # module.prod.module.eks.aws_eks_cluster.this will be updated in-place
~ resource "aws_eks_cluster" "this" {
        id                            = "jfp-eks-prod"
        name                          = "jfp-eks-prod"
        tags                          = {
            "alpha.eksctl.io/cluster-oidc-enabled" = "true"
        }
      ~ version                       = "1.31" -> "1.32"
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.prod.module.postgresql.aws_rds_cluster.default will be updated in-place
~ resource "aws_rds_cluster" "default" {
      + enable_local_write_forwarding         = false
      ~ engine_version                        = "13.20" -> "13.18"
        id                                    = "jfp-core-prod"
        tags                                  = {}
        # (59 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod.module.postgresql.aws_rds_cluster_instance.default will be updated in-place
~ resource "aws_rds_cluster_instance" "default" {
      ~ engine_version                        = "13.20" -> "13.18"
      + force_destroy                         = false
        id                                    = "tf-20240604195536182300000003"
        tags                                  = {}
        # (32 unchanged attributes hidden)
    }

  # module.stage.module.eks.aws_eks_node_group.az_2a_ondemand will be updated in-place
~ resource "aws_eks_node_group" "az_2a_ondemand" {
        id                     = "jfp-eks-stage:jfp-eks-node-group-2a-stage"
        tags                   = {}
        # (17 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 3 -> 2
          ~ max_size     = 5 -> 4
          ~ min_size     = 3 -> 2
        }

        # (2 unchanged blocks hidden)
    }

  # module.stage.module.postgresql.aws_rds_cluster.default will be updated in-place
~ resource "aws_rds_cluster" "default" {
      + enable_local_write_forwarding         = false
      ~ engine_version                        = "13.20" -> "13.18"
        id                                    = "jfp-core-stage"
        tags                                  = {}
        # (59 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.stage.module.postgresql.aws_rds_cluster_instance.default will be updated in-place
~ resource "aws_rds_cluster_instance" "default" {
      ~ engine_version                        = "13.20" -> "13.18"
      + force_destroy                         = false
        id                                    = "tf-20240618004835876400000003"
        tags                                  = {}
        # (32 unchanged attributes hidden)
    }

  # module.prod.module.api-journeys-modern.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-journeys-modern-prod-service"
        name                               = "api-journeys-modern-prod-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-journeys-modern-prod:17" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.prod.module.api-journeys-modern.module.ecs-task.aws_ecs_task_definition.ecs_task_definition must be replaced
+/- resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-journeys-modern-prod:17" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-journeys-modern-prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 1024
                  - environment      = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "SERVICE_ENV"
                          - value = "prod"
                        },
                      - {
                          - name  = "SERVICE_NAME"
                          - value = "api-journeys-modern"
                        },
                    ]
                  - essential        = true
                  - image            = "410965620680.dkr.ecr.us-east-2.amazonaws.com/jfp-api-journeys-modern-prod:latest"
                  - logConfiguration = {
                      - logDriver     = "awsfirelens"
                      - options       = {
                          - Host        = "http-intake.logs.datadoghq.com"
                          - Name        = "datadog"
                          - TLS         = "on"
                          - compress    = "gzip"
                          - dd_service  = "api-journeys-modern"
                          - dd_source   = "graphql-yoga"
                          - dd_tags     = "env:prod"
                          - provider    = "ecs"
                          - retry_limit = "2"
                        }
                      - secretOptions = [
                          - {
                              - name      = "apikey"
                              - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                            },
                        ]
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "jfp-api-journeys-modern-prod-app"
                  - portMappings     = [
                      - {
                          - containerPort = 4004
                          - hostPort      = 4004
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/AWS_ACCESS_KEY_ID"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/AWS_SECRET_ACCESS_KEY"
                        },
                      - {
                          - name      = "CLOUDFLARE_UPLOAD_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/CLOUDFLARE_UPLOAD_KEY"
                        },
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                      - {
                          - name      = "FACEBOOK_APP_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/FACEBOOK_APP_ID"
                        },
                      - {
                          - name      = "FACEBOOK_APP_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/FACEBOOK_APP_SECRET"
                        },
                      - {
                          - name      = "FIREBASE_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/FIREBASE_API_KEY"
                        },
                      - {
                          - name      = "GATEWAY_HMAC_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GATEWAY_HMAC_SECRET"
                        },
                      - {
                          - name      = "GATEWAY_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GATEWAY_URL"
                        },
                      - {
                          - name      = "GIT_BRANCH"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GIT_BRANCH"
                        },
                      - {
                          - name      = "GOOGLE_APPLICATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GOOGLE_APPLICATION_JSON"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GOOGLE_CLIENT_ID"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GOOGLE_CLIENT_SECRET"
                        },
                      - {
                          - name      = "GOOGLE_GENERATIVE_AI_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GOOGLE_GENERATIVE_AI_API_KEY"
                        },
                      - {
                          - name      = "GROWTH_SPACES_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/GROWTH_SPACES_URL"
                        },
                      - {
                          - name      = "INTEGRATION_ACCESS_KEY_ENCRYPTION_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/INTEGRATION_ACCESS_KEY_ENCRYPTION_SECRET"
                        },
                      - {
                          - name      = "INTEROP_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/INTEROP_TOKEN"
                        },
                      - {
                          - name      = "JOURNEYS_ADMIN_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/JOURNEYS_ADMIN_URL"
                        },
                      - {
                          - name      = "JOURNEYS_REVALIDATE_ACCESS_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/JOURNEYS_REVALIDATE_ACCESS_TOKEN"
                        },
                      - {
                          - name      = "JOURNEYS_SHORTLINK_DOMAIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/JOURNEYS_SHORTLINK_DOMAIN"
                        },
                      - {
                          - name      = "JOURNEYS_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/JOURNEYS_URL"
                        },
                      - {
                          - name      = "MAILCHIMP_AUDIENCE_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/MAILCHIMP_AUDIENCE_ID"
                        },
                      - {
                          - name      = "MAILCHIMP_MARKETING_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/MAILCHIMP_MARKETING_API_KEY"
                        },
                      - {
                          - name      = "MAILCHIMP_MARKETING_API_SERVER_PREFIX"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/MAILCHIMP_MARKETING_API_SERVER_PREFIX"
                        },
                      - {
                          - name      = "NAT_ADDRESSES"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/NAT_ADDRESSES"
                        },
                      - {
                          - name      = "OPEN_AI_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/OPEN_AI_API_KEY"
                        },
                      - {
                          - name      = "PG_DATABASE_URL_JOURNEYS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PG_DATABASE_URL_JOURNEYS"
                        },
                      - {
                          - name      = "PLAUSIBLE_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAUSIBLE_API_KEY"
                        },
                      - {
                          - name      = "PLAUSIBLE_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAUSIBLE_URL"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAYWRIGHT_USER_ID"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_2"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAYWRIGHT_USER_ID_2"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_3"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAYWRIGHT_USER_ID_3"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_4"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAYWRIGHT_USER_ID_4"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_5"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAYWRIGHT_USER_ID_5"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_6"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/PLAYWRIGHT_USER_ID_6"
                        },
                      - {
                          - name      = "POWER_BI_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_CLIENT_ID"
                        },
                      - {
                          - name      = "POWER_BI_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_CLIENT_SECRET"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_MULTIPLE_FULL_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_JOURNEYS_MULTIPLE_FULL_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_MULTIPLE_SUMMARY_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_JOURNEYS_MULTIPLE_SUMMARY_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_SINGLE_FULL_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_JOURNEYS_SINGLE_FULL_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_SINGLE_SUMMARY_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_JOURNEYS_SINGLE_SUMMARY_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_TENANT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_TENANT_ID"
                        },
                      - {
                          - name      = "POWER_BI_WORKSPACE_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/POWER_BI_WORKSPACE_ID"
                        },
                      - {
                          - name      = "REDIS_PORT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/REDIS_PORT"
                        },
                      - {
                          - name      = "REDIS_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/REDIS_URL"
                        },
                      - {
                          - name      = "SMTP_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/SMTP_URL"
                        },
                      - {
                          - name      = "VERCEL_JOURNEYS_PROJECT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/VERCEL_JOURNEYS_PROJECT_ID"
                        },
                      - {
                          - name      = "VERCEL_TEAM_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/VERCEL_TEAM_ID"
                        },
                      - {
                          - name      = "VERCEL_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/prod/VERCEL_TOKEN"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - environment       = [
                      - {
                          - name  = "DD_APM_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_APM_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_DOGSTATSD_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_LOGS_INJECTION"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_GRPC_ENDPOINT"
                          - value = "0.0.0.0:4317"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_HTTP_ENDPOINT"
                          - value = "0.0.0.0:4318"
                        },
                      - {
                          - name  = "DD_PROCESS_AGENT_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_PROFILING_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_RUNTIME_METRICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_TAGS"
                          - value = "env:prod app:api-journeys-modern"
                        },
                      - {
                          - name  = "DD_TRACE_ANALYTICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ECS_FARGATE"
                          - value = "true"
                        },
                    ]
                  - essential         = true
                  - image             = "public.ecr.aws/datadog/agent:latest"
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-journeys-modern-prod-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation = 128
                  - mountPoints       = []
                  - name              = "jfp-api-journeys-modern-prod-datadog-agent"
                  - portMappings      = [
                      - {
                          - containerPort = 4317
                          - hostPort      = 4317
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4318
                          - hostPort      = 4318
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 8125
                          - hostPort      = 8125
                          - protocol      = "udp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
              - {
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - config-file-type        = "file"
                          - config-file-value       = "/fluent-bit/configs/parse-json.conf"
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "amazon/aws-for-fluent-bit:stable"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-journeys-modern-prod-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation     = 100
                  - mountPoints           = []
                  - name                  = "jfp-api-journeys-modern-prod-log-router"
                  - portMappings          = []
                  - systemControls        = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "jfp-api-journeys-modern-prod" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["PG_DATABASE_URL_USERS"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/api-journeys/prod/PG_DATABASE_URL_USERS"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "PG_DATABASE_URL_USERS"
        }
      + tags_all       = {
          + "name" = "PG_DATABASE_URL_USERS"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.prod.module.arclight.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
~ resource "aws_ecs_service" "ecs_service" {
      ~ desired_count                      = 4 -> 1
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/arclight-prod-service"
        name                               = "arclight-prod-service"
        tags                               = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.stage.module.api-journeys-modern.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-journeys-modern-stage-service"
        name                               = "api-journeys-modern-stage-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-journeys-modern-stage:17" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.stage.module.api-journeys-modern.module.ecs-task.aws_ecs_task_definition.ecs_task_definition must be replaced
+/- resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-journeys-modern-stage:17" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-journeys-modern-stage" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 1024
                  - environment      = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "SERVICE_ENV"
                          - value = "stage"
                        },
                      - {
                          - name  = "SERVICE_NAME"
                          - value = "api-journeys-modern"
                        },
                    ]
                  - essential        = true
                  - image            = "410965620680.dkr.ecr.us-east-2.amazonaws.com/jfp-api-journeys-modern-stage:latest"
                  - logConfiguration = {
                      - logDriver     = "awsfirelens"
                      - options       = {
                          - Host        = "http-intake.logs.datadoghq.com"
                          - Name        = "datadog"
                          - TLS         = "on"
                          - compress    = "gzip"
                          - dd_service  = "api-journeys-modern"
                          - dd_source   = "graphql-yoga"
                          - dd_tags     = "env:stage"
                          - provider    = "ecs"
                          - retry_limit = "2"
                        }
                      - secretOptions = [
                          - {
                              - name      = "apikey"
                              - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                            },
                        ]
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "jfp-api-journeys-modern-stage-app"
                  - portMappings     = [
                      - {
                          - containerPort = 4004
                          - hostPort      = 4004
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/AWS_ACCESS_KEY_ID"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/AWS_SECRET_ACCESS_KEY"
                        },
                      - {
                          - name      = "CLOUDFLARE_UPLOAD_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/CLOUDFLARE_UPLOAD_KEY"
                        },
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                      - {
                          - name      = "FACEBOOK_APP_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/FACEBOOK_APP_ID"
                        },
                      - {
                          - name      = "FACEBOOK_APP_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/FACEBOOK_APP_SECRET"
                        },
                      - {
                          - name      = "FIREBASE_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/FIREBASE_API_KEY"
                        },
                      - {
                          - name      = "GATEWAY_HMAC_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GATEWAY_HMAC_SECRET"
                        },
                      - {
                          - name      = "GATEWAY_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GATEWAY_URL"
                        },
                      - {
                          - name      = "GIT_BRANCH"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GIT_BRANCH"
                        },
                      - {
                          - name      = "GOOGLE_APPLICATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GOOGLE_APPLICATION_JSON"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GOOGLE_CLIENT_ID"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GOOGLE_CLIENT_SECRET"
                        },
                      - {
                          - name      = "GOOGLE_GENERATIVE_AI_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GOOGLE_GENERATIVE_AI_API_KEY"
                        },
                      - {
                          - name      = "GROWTH_SPACES_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/GROWTH_SPACES_URL"
                        },
                      - {
                          - name      = "INTEGRATION_ACCESS_KEY_ENCRYPTION_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/INTEGRATION_ACCESS_KEY_ENCRYPTION_SECRET"
                        },
                      - {
                          - name      = "INTEROP_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/INTEROP_TOKEN"
                        },
                      - {
                          - name      = "JOURNEYS_ADMIN_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/JOURNEYS_ADMIN_URL"
                        },
                      - {
                          - name      = "JOURNEYS_REVALIDATE_ACCESS_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/JOURNEYS_REVALIDATE_ACCESS_TOKEN"
                        },
                      - {
                          - name      = "JOURNEYS_SHORTLINK_DOMAIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/JOURNEYS_SHORTLINK_DOMAIN"
                        },
                      - {
                          - name      = "JOURNEYS_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/JOURNEYS_URL"
                        },
                      - {
                          - name      = "MAILCHIMP_AUDIENCE_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/MAILCHIMP_AUDIENCE_ID"
                        },
                      - {
                          - name      = "MAILCHIMP_MARKETING_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/MAILCHIMP_MARKETING_API_KEY"
                        },
                      - {
                          - name      = "MAILCHIMP_MARKETING_API_SERVER_PREFIX"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/MAILCHIMP_MARKETING_API_SERVER_PREFIX"
                        },
                      - {
                          - name      = "NAT_ADDRESSES"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/NAT_ADDRESSES"
                        },
                      - {
                          - name      = "OPEN_AI_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/OPEN_AI_API_KEY"
                        },
                      - {
                          - name      = "PG_DATABASE_URL_JOURNEYS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PG_DATABASE_URL_JOURNEYS"
                        },
                      - {
                          - name      = "PLAUSIBLE_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAUSIBLE_API_KEY"
                        },
                      - {
                          - name      = "PLAUSIBLE_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAUSIBLE_URL"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAYWRIGHT_USER_ID"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_2"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAYWRIGHT_USER_ID_2"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_3"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAYWRIGHT_USER_ID_3"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_4"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAYWRIGHT_USER_ID_4"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_5"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAYWRIGHT_USER_ID_5"
                        },
                      - {
                          - name      = "PLAYWRIGHT_USER_ID_6"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/PLAYWRIGHT_USER_ID_6"
                        },
                      - {
                          - name      = "POWER_BI_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_CLIENT_ID"
                        },
                      - {
                          - name      = "POWER_BI_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_CLIENT_SECRET"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_MULTIPLE_FULL_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_JOURNEYS_MULTIPLE_FULL_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_MULTIPLE_SUMMARY_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_JOURNEYS_MULTIPLE_SUMMARY_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_SINGLE_FULL_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_JOURNEYS_SINGLE_FULL_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_JOURNEYS_SINGLE_SUMMARY_REPORT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_JOURNEYS_SINGLE_SUMMARY_REPORT_ID"
                        },
                      - {
                          - name      = "POWER_BI_TENANT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_TENANT_ID"
                        },
                      - {
                          - name      = "POWER_BI_WORKSPACE_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/POWER_BI_WORKSPACE_ID"
                        },
                      - {
                          - name      = "REDIS_PORT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/REDIS_PORT"
                        },
                      - {
                          - name      = "REDIS_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/REDIS_URL"
                        },
                      - {
                          - name      = "SMTP_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/SMTP_URL"
                        },
                      - {
                          - name      = "VERCEL_JOURNEYS_PROJECT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/VERCEL_JOURNEYS_PROJECT_ID"
                        },
                      - {
                          - name      = "VERCEL_TEAM_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/VERCEL_TEAM_ID"
                        },
                      - {
                          - name      = "VERCEL_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-journeys/stage/VERCEL_TOKEN"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - environment       = [
                      - {
                          - name  = "DD_APM_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_APM_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_DOGSTATSD_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_LOGS_INJECTION"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_GRPC_ENDPOINT"
                          - value = "0.0.0.0:4317"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_HTTP_ENDPOINT"
                          - value = "0.0.0.0:4318"
                        },
                      - {
                          - name  = "DD_PROCESS_AGENT_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_PROFILING_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_RUNTIME_METRICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_TAGS"
                          - value = "env:stage app:api-journeys-modern"
                        },
                      - {
                          - name  = "DD_TRACE_ANALYTICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ECS_FARGATE"
                          - value = "true"
                        },
                    ]
                  - essential         = true
                  - image             = "public.ecr.aws/datadog/agent:latest"
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-journeys-modern-stage-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation = 128
                  - mountPoints       = []
                  - name              = "jfp-api-journeys-modern-stage-datadog-agent"
                  - portMappings      = [
                      - {
                          - containerPort = 4317
                          - hostPort      = 4317
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4318
                          - hostPort      = 4318
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 8125
                          - hostPort      = 8125
                          - protocol      = "udp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
              - {
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - config-file-type        = "file"
                          - config-file-value       = "/fluent-bit/configs/parse-json.conf"
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "amazon/aws-for-fluent-bit:stable"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-journeys-modern-stage-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation     = 100
                  - mountPoints           = []
                  - name                  = "jfp-api-journeys-modern-stage-log-router"
                  - portMappings          = []
                  - systemControls        = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "jfp-api-journeys-modern-stage" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.stage.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["PG_DATABASE_URL_USERS"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/api-journeys/stage/PG_DATABASE_URL_USERS"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "PG_DATABASE_URL_USERS"
        }
      + tags_all       = {
          + "name" = "PG_DATABASE_URL_USERS"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 4 to add, 9 to change, 2 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with module.datadog.datadog_integration_aws.sandbox,
│   on modules/aws/datadog/main.tf line 118, in resource "datadog_integration_aws" "sandbox":
│  118: resource "datadog_integration_aws" "sandbox" {
│ 
│ **This resource is deprecated - use the `datadog_integration_aws_account`
│ resource instead**:
│ https://registry.terraform.io/providers/DataDog/datadog/latest/docs/resources/integration_aws_account
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/datadog.datadog_log_forwarder/modules/log_forwarder/main.tf line 2, in locals:
│    2:   bucket_name = var.bucket_name != "" ? var.bucket_name : "datadog-forwarder-${data.aws_caller_identity.current.account_id}-${data.aws_region.current.name}"
│ 
│ The attribute "name" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 2 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.central.jesusfilm.org/lock?id=JesusFilm%252Fcore%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infrastructure
  ```

**Note: Objects have changed outside of Terraform**
Plan: 4 to add, 9 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```